class IPАдрес {
	[propertyType] $PropertyName
}



# Тестирование ########################################

[IPАдрес]::new("1.2.3.4")
[IPАдрес]::new("001.002.003.004")
[IPАдрес]::new("005.006.007.008/32")
[IPАдрес]::new("005.006.007.008", 32)
[IPАдрес]::new("111.222.333.444") # недействительно!
[IPАдрес]::new("9.8.7.0/24")
[IPАдрес]::new("9.8.7.0", 24)
[IPАдрес]::new("9.8.7.6/24") # исправить!
[IPАдрес]::new("9.8.7.6", 24) # исправить!

[IPАдрес]"1.2.3.4"
[IPАдрес]"5.6.7.8/32"
[IPАдрес]"9.8.7.0/24"

$adr = [IPАдрес]"1.2.3.4"
$adr.СтандартнаяФорма # [string] 1.2.3.4
$adr.ДополненнаяФорма # [string] 001.002.003.004/32
$adr.ДвоичнаяФорма # [string] 00000001.00000010.00000011.00000100
$adr.МаскаДиапазона # [byte] 32
$adr.НачалоДиапазона # [IPАдрес]/32
$adr.КонецДиапазона # [IPАдрес]/32

$adr.ОбъединитьСъ("1.2.3.44", 24) # [IPАдрес] или $null
$adr.ОбъединитьСъ("1.2.3.0/28", 24) # [IPАдрес] или $null
$adr.ОбъединитьСъ([IPАдрес]"1.2.3.44", 24) # [IPАдрес] или $null

