Clear-Host

. '.\Тип IP-адреса.ps1'

$DebugPreference = 'Continue'

trap {  }

# Ошибки ############################################
# [IPАдрес]::new("111.222.333")
# [IPАдрес]::new("1.22.333.4444")
# [IPАдрес]::new("111.222.333.444")
# [IPАдрес]::new("11.22.33.44/99")
# [IPАдрес]::new("9.8.7.6/24")
# [IPАдрес]::new("111.222.333.444", 9)
# [IPАдрес]::new("11.22.33.44", 99)

# Создание объектов #################################
# [IPАдрес]::new("1.2.3.4")
# [IPАдрес]::new("001.002.003.004")
# [IPАдрес]::new("005.006.007.008/32")
# [IPАдрес]::new("005.006.007.008", 32)

# [IPАдрес]::new("9.8.7.6", 24) # адрес в диапазон
# [IPАдрес]::new("9.8.7.0/24")
# [IPАдрес]::new("9.8.7.0", 24)

[IPАдрес]"1.2.3.4"
[IPАдрес]"5.6.7.8/32"
[IPАдрес]"9.8.7.0/24"
[IPАдрес]"9.8.0.0/16"

# Объединение адресов ###############################
# $adr = [IPАдрес]"1.2.3.4"
# $adr.ОбъединитьСъ("1.2.3.44", 24)
# $adr.ОбъединитьСъ("1.2.3.0/28", 24)
# $adr.ОбъединитьСъ([IPАдрес]"1.2.3.44", 24)
# $adr.ОбъединитьСъ("1.2.4.55", 24)

$iplist =
	"111.1.1.255",
	"111.1.1.254",
	"111.1.1.250",

	"77.2.2.1/32",
	"77.2.2.11",

	"1.8.8.8",
	"2.8.8.8",
	"3.8.8.8"

[IPАдрес]::ОбъединитьВъДиапазоны($iplist, 24)
