. '.\Функции для IP-адресов.ps1'

Clear-Host
$DebugPreference = "Continue"

ПривестиВъДополненнуюФорму "1.2.3.4"
"1.2.3.4/9" | ПривестиВъДополненнуюФорму
ПривестиВъСтандартнуюФорму "001.002.003.004/32"
ПривестиВъСтандартнуюФорму "9.8.7.6/32"
"001.002.003.004/09" | ПривестиВъСтандартнуюФорму

АдресДесятичныйВъДвоичный "9.123.234.88"
АдресДвоичныйВъДесятичный "10001001011110111110101001011001"
МаскуВъАдресДвоичный "24"

АдресСъМаскойВъГраницы "9.123.234.88" 28
АдресСъМаскойВъГраницы "9.123.234.88" 24

"1.2.3.4", "5.6.7.8" | АдресСъМаскойВъДиапазон 24
АдресСъМаскойВъДиапазон 24 "9.8.7.6"


$iplist =
	"111.1.1.255",
	"111.1.1.254",
	"111.1.1.250",

	"77.2.2.1/32",
	"77.2.2.11",

	"1.8.8.8",
	"2.8.8.8",
	"3.8.8.8"
ОбъединитьВъДиапазоны $iplist -ПредельнаяМаска 24
