Clear-Host

. '.\Тип IP-адреса.ps1'

$DebugPreference = 'Continue'

trap {  }

# [IPАдрес]::new("1.2.3.4")
# [IPАдрес]::new("001.002.003.004")
# [IPАдрес]::new("005.006.007.008/32")
# [IPАдрес]::new("005.006.007.008", 32)

[IPАдрес]::new("111.222.333") # недействительно!
[IPАдрес]::new("111.222.333.444") # недействительно!
[IPАдрес]::new("11.22.33.44/99") # недействительно!
[IPАдрес]::new("9.8.7.6/24") # ошибка!
[IPАдрес]::new("111.222.333.444", 9) # недействительно!
[IPАдрес]::new("11.22.33.44", 99) # недействительно!

# [IPАдрес]::new("9.8.7.6", 24) # адрес в диапазон
# [IPАдрес]::new("9.8.7.0/24")
# [IPАдрес]::new("9.8.7.0", 24)

# [IPАдрес]"1.2.3.4"
# [IPАдрес]"5.6.7.8/32"
# [IPАдрес]"9.8.7.0/24"

<# $adr = [IPАдрес]"1.2.3.4"
$adr.СтандартнаяФорма # [string] 1.2.3.4
$adr.ДополненнаяФорма # [string] 001.002.003.004/32
$adr.ДвоичнаяФорма # [string] 00000001.00000010.00000011.00000100'
$adr.МаскаДиапазона # [byte] 32
$adr.НачалоДиапазона # [IPАдрес] 1.2.3.4/32
$adr.КонецДиапазона # [IPАдрес] 1.2.3.4/32

$adr = [IPАдрес]"9.8.7.0/24"
$adr.СтандартнаяФорма # [string] 9.8.7.0
$adr.ДополненнаяФорма # [string] 009.008.007.000/24
$adr.ДвоичнаяФорма # [string] 00001001.00001000.00000111.'00000000
$adr.МаскаДиапазона # [byte] 24
$adr.НачалоДиапазона # [IPАдрес] 9.8.7.0/32
$adr.КонецДиапазона # [IPАдрес] 9.8.7.255/32
 #>
# $adr.ОбъединитьСъ("1.2.3.44", 24) # [IPАдрес] или $null
# $adr.ОбъединитьСъ("1.2.3.0/28", 24) # [IPАдрес] или $null
# $adr.ОбъединитьСъ([IPАдрес]"1.2.3.44", 24) # [IPАдрес] или $null

