. '.\Функции для IP-адресов.ps1'

Clear-Host
$DebugPreference = "Continue"

ПривестиВъДополненнуюФорму "1.2.3.4"
ПривестиВъДополненнуюФорму "1.2.3.4/9"
ПривестиВъСтандартнуюФорму "001.002.003.004/32"
ПривестиВъСтандартнуюФорму "001.002.003.004/09"
ПривестиВъСтандартнуюФорму "9.8.7.6/32"

АдресДесятичныйВъДвоичный "9.123.234.88"
АдресДвоичныйВъДесятичный "10001001011110111110101001011001"
МаскуВъАдресДвоичный "24"
АдресСъМаскойВъГраницы "9.123.234.88" 28
АдресСъМаскойВъГраницы "9.123.234.88" 24

"1.2.3.4", "5.6.7.8" | АдресСъМаскойВъДиапазон 24
АдресСъМаскойВъДиапазон 24 "9.8.7.6"
